Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Yourcomputermaster/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ВыполненныеСотрудникомРаботы(Сотрудник, ПериодНачало, ПериодКонец)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплате, 0)) КАК ПроцентОтРабот,
	               |	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	               |ГДЕ
	               |	ВКМ_ВыполненныеСотрудникомРаботы.ДатаПроведенияРабот МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник = &Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник";
	Запрос.УстановитьПараметр("ПериодНачало",  ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец",  ПериодКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ПроцентОтРабот;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли
